extern c_main
global _start

; 注意: nasm -f elf32 默认是 BITS 32，但 _start 这一段是运行在 16 位实模式下的。
; 如果不写 BITS 16，lgdt/jmp 这类指令会按 32 位编码，实模式下会被解码成完全不同的指令。
BITS 16
section .text
_start:
    ; 1. 禁用中断 (实模式的中断向量表在保护模式下没用)
    cli
    ; 2.做这样一件事情：我们的第21根总线(A20)默认是被设置成0，这样硬件默认是设置成了只读取前19根总线，这种情况下原来的1MB的应用
    ; 可以被正常执行（兼容性）。但是我们要是想要开放它，就需要我们将这个总线设置成1
    ; 而修改它的端口在0x92的第1位（从0开始），其他的位是控制别的，我们不能管它
    in al, 0x92
    or al,0b00000010
    out 0x92, al
    ;3. 我们的GDTR寄存器是一个6字节(48位)大小的寄存器。低16位放的是内存大小（界限），高32位放的是内存基址（物理地址）
    lgdt [gdt_descriptor]

; 4. 置位 CR0，正式开启保护模式
    mov eax, cr0
    or eax, 1
    mov cr0, eax

    ; 5. 远跳转，清洗 16 位流水线，跳入 32 位代码段 (0x08 是代码段选择子)
    ; 关于这一段的内容：我们这个语法是当我们的CPU进入了保护模式后，我们的整个跳转可以使用的内容：我们的寻址会
    ; 用这个语法 段选择子:偏转位置。此时相当于我们现在让我们在GDT里面找到第0x08的内容里面所标注的内存空间
    ;即是说查找那个0到4GB的部分，然后跳转到里面的start32的代码进行执行

    jmp 0x08:start32

; 临时 GDT 数据 (数组)
;这个数组在做什么呢？ dq=define quad word，即是说定义了四个word=8byte，它分别放了不同的内容
; 我们在这里使用0x00CF9A000000FFFF或者别的直接硬编码了二进制，它直接表示完全了这个段占据了从0到4GB，与其权限
;其中代码段9A是可执行可读写，而数据段不包含执行权限

align 8
gdt_start:
    dq 0x0000000000000000   ; 第 0 项: 空描述符
    dq 0x00CF9A000000FFFF   ; 第 1 项: 32位平坦模型 代码段 (0-4GB)
    dq 0x00CF92000000FFFF   ; 第 2 项: 32位平坦模型 数据段 (0-4GB)
gdt_end:                    ;这里直接空出来，相当于标注了上文代码执行结束后的地址，刚好就是分配结束的位置
;在上文的基础上，我们自然就有了界限和基址。并且英特尔规定，界限值是从 0 开始计数的（如果界限是 0，代表表的大小为 1 字节），所以必须在最后 - 1
gdt_descriptor:
    dw gdt_end - gdt_start - 1  ; GDT 表界限 (大小-1)
    dd gdt_start                ; GDT 物理基地址

; ==========================================
; 32 位保护模式环境
; ==========================================
BITS 32
start32:
    ; 6. 初始化所有数据段寄存器指向数据段选择子 (0x10)
    mov ax, 0x10 ;为什么这里是0x10？因为我们现在开始进入的是第二段，也就是偏转为16的内容，此时写作16进制就是10
    mov ds, ax
    mov es, ax
    mov fs, ax
    mov gs, ax
    mov ss, ax

    ; 7. 设置 C 语言的栈底 (找一块宽敞的空闲内存，比如 0x90000)
    mov esp, 0x90000

    ;继续开启64位长模式
    ;建立4级页表，映射前1GB（提前完成paging的内容，也是长模式的要求）
    ;TODO

    ; 8. 调用 C 语言主函数！
    call c_main

    ; 如果 C 语言意外 return 返回了，就在这里死循环卡住
    jmp $